import admin from "./../img/slides/lecturer/admin.jpg";
import lecturer_assessment from "./../img/slides/lecturer/lecturer-assessment.jpg";
import lecturer_different from "./../img/slides/lecturer/lecturer-different.jpg";
import lecturer_election from "./../img/slides/lecturer/lecturer-election.jpg";
import lecturer_journal from "./../img/slides/lecturer/lecturer-journal.jpg";
import lecturer_login from "./../img/slides/lecturer/lecturer-login.jpg";
import lecturer_office from "./../img/slides/lecturer/lecturer-office.jpg";
import lecturer_report from "./../img/slides/lecturer/lecturer-report.jpg";

const lecturerSlides = [
	{
		title: 'Отримайте обліковий запис',
		img: admin,
		text: (
			<div>
			<ul>
				<li>
					<strong>1. Зверніться до свого адміністратора:</strong><br></br>Зверніться до системного адміністратора свого закладу для отримання облікового запису.
				</li>
				<li>
					<strong>2. Отримайте логін та пароль:</strong><br></br>Після звернення до адміністратора Вам буде видано особистий логін та пароль, які Ви зможете використовувати для входу в систему застосунка.
				</li>
				<li>
					<strong>3. Бережіть свій обліковий запис:</strong><br></br>Обов'язково зберігайте свої облікові дані у безпечному місці та не передавайте їх іншим користувачам, щоб не допустити їх неправомірне використання.
				</li>
				<li>
					<strong>4. Звертайтеся за допомогою</strong><br></br>У разі втрати облікових даних або будь-яких труднощів із входом у систему звертайтеся до свого системного адміністратора для отримання допомоги.
				</li>
			</ul>
			</div>
			),
	},
	{
		title: 'Увійдіть у застосунок',
		img: lecturer_login,
		text: (
			<div>
			<ul>
				<li>
					<strong>1. Встановіть застосунок:</strong><br></br>Завантажне застосунок з головної сторінки та встановіть його, виконуючи вказівки установника. 
				</li>
				<li>
					<strong>2. Введіть логін та пароль:</strong><br></br>Після запуску застосунку вас буде вітати екран входу. Введіть свій користувацький логін та пароль у відповідні поля. Переконайтесь в правильності введених даних та підтвердіть вхід.
				</li>
				<li>
					<strong>3. Особистий кабінет:</strong><br></br>Після успішного входу ви отримаєте доступ до свого особистого кабінету, де ви зможете переглядати та управляти своїми особистими даними, робити необхідні налаштування та використовувати функціонал застосунку.
				</li>
			</ul>
			</div>
			),
	},
	{
		title: 'Дослідіть Ваш особистий кабінет',
		img: lecturer_office,
		text: (
			<div>
				<p>
					Якщо вхід виконан успішно, то першим Ви побачите свій особистий кабінет. В ньому відображається особиста інформація викладача, наприклад: ПІБ, адреса, контактні дані, курируєма група тощо, а також тут можна переглянути дисципліни, які Ви викладаєте у поточному семестрі.
				</p>
			</div>
		),
	},
	{
		title: 'Перевірте журнал викладача',
		img: lecturer_journal,
		text: (
			<div>
				<p>
					Якщо ви куратор групи студентів, то обов'язково перевірте журнал викладача. В ньому можна дізнатися все необхідне про студентів Вашої групи, а саме: особиста інформація, студенти-біженці, які дисципліни обрав кожний студент тощо.
				</p>
			</div>
		),
	},
	{
		title: 'Обирайте дисципліни за студентів',
		img: lecturer_election,
		text:  (
			<div>
				<p>
					Переглядайте списки вибіркових дисциплін та студентів, які ще не зробили свій вибір. Для кожного студента відображається, скільки дисциплін для нього ще залишилося обрати, і якщо це так, то можна зробити вибір за нього.
				</p>
			</div>
		),
	},
	{
		title: 'Оцінюйте студентів',
		img: lecturer_assessment,
		text: (
			<div>
				<p>
					Майте можливість оцінити студента зі своєї дисципліни. Для цього оберіть одну зі своїх дисциплін, оберіть студента завдяки фільтрам по факультетам, кафедрам та групам, виставте оцінку і підтвердіть рішення.
				</p>
			</div>
		),
	},
	{
		title: 'Отримуйте актуальну інформацію',
		img: lecturer_different,
		text: (
			<div>
				<p>
					Також Ви можете переглядати основну поточну інформацію про інших викладачів, дисципліни та студентів інших груп. Дізнайтеся, які студенти відвідують Вашу дисципліну, які дисципліни будуть у наступному семестрі, рейтинги студентів та багато іншого.
				</p>
			</div>
		),
	},
	{
		title: 'Зберігайте необхідне',
		img: lecturer_report,
		text: (
			<div>
				<p>
					Якщо Ви виконали запит на пошук певної інформації і хочете зберегти результат, то поруч з кнопками "Виконати" є кнопки "Звітувати", які записують результати на екрані у .pdf файл і зберігають його у зручне для Вас місце на комп'юторі.
				</p>
			</div>
		),
	},
];

export { lecturerSlides }